{"sbt": 39, "version": 14984, ".": 262746, "<cm-sep>": 94443, "spectator": 12, "jackson": 217, "scala": 165, "in": 47348, "particular": 428, "would": 2332, "like": 2094, "to": 102113, "get": 5584, "consistently": 100, "as": 15416, "a": 55834, "<nl>": 209672, "transitive": 150, "lokalise": 15, ":": 35347, "update": 10570, "of": 47863, "src/main/resources/web_de.properties": 2, "src/main/resources/web_en.properties": 2, "bumps": 60, "next": 1228, "minor": 1745, "this": 34293, "pull": 1499, "request": 3889, "was": 7233, "initiated": 37, "by": 12548, "(": 46241, "user": 5176, "marc": 9, "egenrieder": 3, ")": 47240, "at": 5251, "sha": 3090, "0": 21530, "bugfix": 424, "sortables": 1, "handle": 1801, "nested": 356, "elements": 796, "when": 13506, "sortable": 23, "list": 4572, "contains": 1304, "lists": 386, "the": 153405, "same": 3406, "type": 4772, ",": 72995, "drag": 81, "and": 48488, "drop": 516, "not": 21159, "possible": 1330, "commit": 3128, "adds": 3428, "logic": 1472, "allow": 2683, "performing": 118, "depth-first": 10, "search": 1767, "however": 646, "there": 4691, "still": 1911, "appears": 198, "be": 20760, "some": 7389, "faulty": 23, "positioning": 20, "placeholder": 154, "so": 7825, "jumps": 10, "around": 745, "cases": 1387, "will": 9819, "addressed": 139, "another": 1160, "safari": 36, "removing": 1482, "items": 1130, "missing": 2158, "character": 438, "selector": 177, "causing": 438, "an": 12372, "error": 4813, "online": 154, "browser": 414, "after": 3674, "dragging": 27, "item": 1384, "it": 22516, "being": 2064, "removed": 4960, "updated": 4773, "files": 4144, "for": 52605, "better": 1772, "feedback": 604, "merge": 7996, "remote-tracking": 1852, "branch": 7281, "'": 47095, "origin": 138, "into": 9715, "feature/parser-feedback": 1, "tests": 10351, "signature": 261, "fixed": 6435, "build": 3732, "added": 14308, "license": 2764, "parsing": 850, "more": 6167, "deserialization": 122, "preserved": 57, "order": 2174, "test": 15176, "file": 8698, "stack": 606, "traces": 87, "printout": 10, "updates": 1736, "enabled": 849, "resolver": 184, "extensions": 280, "sigs": 6, "examples": 426, "code": 9392, "cleanup": 1764, "<para-sep>": 29478, "if": 19077, "system.getproperty": 19, "'debugparser": 1, "!": 3709, "=": 4225, "null": 3821, "{": 3154, "required": 1694, "todo": 4401, "parse": 666, "optional": 834, "swagger.responses": 1, "responses": 273, ";": 12172, "extra": 908, "keys": 877, "json.prettyprint": 1, "swagger": 194, "system.out.println": 374, "yaml.mapper": 1, ".writevalueasstring": 3, "implemented": 1167, "need": 3852, "set": 7405, "properties": 2047, "first": 3297, "model.title": 1, "value": 4885, "name": 5794, "am.setvendorextension": 1, "impl.setadditionalproperties": 1, "impl.setdefaultvalue": 1, "impl.setdiscriminator": 1, "impl.setxml": 1, "impl.setexternaldocs": 1, "m.setexample": 1, "example": 1703, "multipleof": 1, "maximum": 377, "boolean": 607, "bool": 34, "getboolean": 9, "'exclusivemaximum": 1, "node": 1762, "false": 1121, "location": 1167, "result": 1741, "'exclusiveminimum": 1, "maxlength": 14, "minlength": 1, "pattern": 713, "maxitems": 8, "minitems": 1, "uniqueitems": 1, "maxproperties": 1, "minproperties": 1, "enum": 618, "additionalproperties": 1, "we": 13775, "only": 7455, "support": 5262, "one": 5100, "parent": 959, "no": 6348, "multiple": 1649, "inheritance": 92, "or": 8956, "composition": 40, "return": 3423, "json.mapper": 2, ".convertvalue": 2, "composedmodel.class": 1, "text": 1981, "object": 3198, "nodes": 732, "mostly": 214, "complete": 692, "implementation": 2556, "giving": 102, "adding": 3809, "validation": 1095, "partition": 131, "streams": 277, "fixing": 1778, "issues": 1919, ">": 15475, "currently": 1380, "partitions": 52, "can": 9045, "defined": 829, "with": 21314, "nonexisting": 3, "they": 2732, "are": 13081, "simply": 395, "omitted": 35, "might": 917, "cause": 906, "errors": 1561, "fix": 15485, "is": 41618, "throw": 1020, "on": 19757, "existing": 1555, "steams": 1, "improve": 1339, "experience": 123, "helping": 16, "write": 1063, "proper": 691, "siddhi": 242, "queries": 565, "validations": 59, "partitioned": 17, "within": 873, "definition": 517, "check": 5803, "person": 164, "exists": 885, "longer": 1140, "strictly": 54, "matches": 458, "identification": 38, "number": 2624, "master": 3824, "acdm-0": 24, "searches": 104, "people": 267, "givenname": 1, "familyname": 1, "corrects": 84, "rounding": 40, "mistake": 125, "jquery": 142, "width": 298, "tiny": 78, "bump": 539, "documentation": 1668, "which": 6980, "could": 1634, "two": 1815, "rows": 250, "displayed": 461, "should": 8222, "notion": 8, "edition": 258, "context": 1614, "model": 1460, "selectioncommand": 1, "contexts": 107, "selection": 451, "action": 1171, "scene": 291, "listener": 644, "uses": 1532, "seteditioncontext": 1, "addsceneelement": 1, "entity": 1169, "edit": 551, "eadventure": 274, "research": 547, "project": 2719, "e-ucm": 258, "group": 1496, "sets": 1164, "current": 2425, "<": 12979, "dl": 35, "dt": 33, "strong": 90, "arguments": 640, "/strong": 51, "/dt": 25, "new": 10915, "context.": 2, "/dd": 40, "/dl": 21, "marks": 130, "edited": 121, "element": 993, "but": 6038, "also": 6435, "single": 1481, "javadocs": 229, "'re": 689, "website": 137, "little": 482, "script": 1186, "add": 18463, "primitive": 193, "index": 1689, "page": 2721, "mmc/v0.8.0/javadocs": 1, "note": 1804, "that": 23139, "all": 9734, "content": 1803, "records": 433, "createdat": 4, "updatedat": 12, "createdby": 3, "updatedby": 3, "data": 4951, "creation": 907, "secret": 168, "_series_": 2, "_content_": 2, "equivalent": 198, "its": 2398, "characteristics": 24, "listed": 124, "time": 3669, "ordering": 240, "pretty": 204, "-": 26888, "later": 920, "wanted": 125, "gets": 1157, "job": 1479, "done": 1201, "`": 24567, "keyword": 148, "inputstreams": 9, "js": 323, "runtime": 668, "sometimes": 292, "returns": 2870, "mangles": 2, "global": 622, "window": 475, "instead": 4368, "inputstream": 156, "prevented": 72, "using": 5810, "other": 3596, "calls": 1110, "constructor": 1610, "charstreams.fromstring": 3, "returning": 423, "similar": 449, "helper": 632, "methods": 3766, "perhaps": 86, "i": 8821, "'m": 604, "doing": 510, "something": 626, "wrong": 939, "...": 2827, "happy": 158, "mistaken": 8, "create": 4764, "valuesexception": 1, "split": 477, "different": 1830, "causes": 382, "exception": 3184, "wrap": 266, "java": 2916, "throwing": 250, "datetimeexception": 1, "change": 6679, "types": 1622, "message": 3590, "empty": 2278, "map": 2285, "unused": 1895, "arithmetic": 25, "handling": 1446, "durationbetween": 1, "tostring": 240, "rename": 1273, "use": 12857, "both": 1591, "temporal": 54, "spatial": 85, "back": 1797, "illegalstateexception": 67, "typo": 887, "remove": 8418, "such": 1005, "durations": 24, "unsuccessful": 26, "operations": 684, "include": 1357, "supported": 780, "trying": 557, "thrown": 656, "during": 1378, "usage": 1095, "values": 2744, "module": 1732, "org.neo4j.values": 1, "custom": 1488, "valuesexceptions": 1, "then": 3244, "converted": 281, "cypherexceptions": 1, "before": 3143, "reaching": 30, "surface": 95, "retrofit": 48, "minishuttleroute": 1, "main": 1008, "shuttle": 7, "screen-": 1, "skips": 55, "over": 1060, "loading": 859, "unneeded": 210, "stops": 229, "makes": 1208, "db": 868, "load": 1261, "much": 594, "faster": 243, "intrepid": 20, "intrepid-chris": 10, "drastically": 9, "reduces": 115, "screen": 848, "ex": 141, "~5000ms": 1, "~200ms": 1, "move": 2465, "since": 2628, "looked": 72, "ahead": 84, "id": 2597, "otto": 8, "application": 1496, "class": 7329, "hooked": 17, "up": 4946, "anything": 508, "yet": 967, "created": 3362, "stripped-down": 1, "mitshuttleroute": 3, "grabs": 16, "closest": 51, "from": 17537, "predictable": 25, "routes": 96, "simple": 1103, "alias": 274, "assignments": 84, "externs": 22, "inference": 32, "let": 940, "const": 49, "namespace": 264, "aliasing": 8, "nodeutil.isnamedeclaration": 1, "manual": 386, "checks": 1350, "var": 153, "used": 6744, "infer": 36, "aliases": 146, "compiler": 339, "correctly": 1095, "assigned": 207, "removes": 948, "spurious": 48, "warning": 1063, "generated": 1244, "lines": 648, "ability": 760, "show": 1746, "preview": 234, "widget": 456, "full-screen": 10, "modal": 167, "dismiss": 21, "put": 859, "clean": 1419, "image": 1572, "click": 369, "anywhere": 86, "popup": 200, "close": 988, "s": 753, "association": 96, "param": 312, "find": 1210, "renamed": 682, "predicates": 42, "config": 2418, "associations": 43, "took": 121, "out": 2863, "definitions": 234, "now": 6609, "reside": 17, "resources": 1149, "michael": 7, "per": 1153, "your": 1070, "prior": 241, "refactoring": 911, "predicates.yml": 1, "associations.yml": 2, "stephen": 5, "introduced": 468, "detect": 305, "raise": 62, "attempt": 632, "construct": 282, "duplicate": 714, "goes": 190, "hand": 154, "changes": 6286, "pyon": 5, "coi-services": 5, "see": 2176, "requests": 1047, "those": 888, "repos": 86, "coming": 142, "soon": 210, "auto": 356, "negotiate": 13, "otr": 53, "resend": 20, "activated": 137, "issue": 3341, "make": 5487, "offers": 46, "retry": 374, "negotiation": 47, "send": 1116, "without": 2272, "start": 1930, "session": 1116, "resent": 10, "caller": 172, "encrypted": 130, "unfilled": 3, "throttle": 34, "starts": 371, "restart": 209, "transfer": 203, "sdk": 511, "scenecomposer": 13, "local": 1443, "camera": 156, "choice": 125, "option": 1732, "tool": 389, "scale": 227, "work": 2984, "enhancement": 179, "forget": 88, ".form": 1, "rework": 139, "tooltip": 125, "jcombobox": 11, "modified": 1054, "rotate": 46, "tools": 428, "in-development": 1, "transformation": 109, "works": 1075, "act": 52, "realy": 5, "weird": 127, "jmonkeyengine/master": 2, "scenecomposer/master": 3, "transform": 151, "translation": 687, "space": 634, "iterations": 60, "contact": 158, "solver": 26, "default": 5765, "low": 129, "quality": 168, "high": 169, "obstacle": 2, "mesh": 32, "does": 4925, "mass=0": 2, "floor": 86, "render": 357, "ourselves": 54, "collision": 62, "choose": 280, "pickmanager": 1, "providing": 179, "corresponding": 390, "migration": 325, "path": 2299, "getting": 794, "started": 659, "view": 1751, "accidental": 61, "squash": 54, "--": 3987, "mention": 110, "eap": 41, "link": 1399, "paths": 545, "section": 695, "windup": 37, "guide": 261, "getexternalstoragedirectory": 1, "internal": 805, "sd": 33, "card": 326, "needed": 1675, "compairing": 2, "selected": 688, "minternalsdcardlocation": 4, "quransettingsfragment": 2, "line": 2002, "environment.getexternalstoragedirectory": 2, ".getabsolutepath": 8, "collection": 893, "follow": 364, "android": 1422, "cards": 134, "naming": 403, "conventions": 81, "mounts": 7, "rather": 907, "than": 2521, "mount": 25, "point": 979, "considered": 207, "external": 657, "``": 1492, "found": 1424, "codacy": 83, "generate": 860, "final": 1079, "key": 2368, "input": 1581, "string": 4456, "bug": 2885, "[": 10028, "x": 1860, "]": 9998, "non-breaking": 226, "fixes": 4062, "feature": 1681, "functionality": 1124, "breaking": 365, "deprecated/redundant": 1, "classes": 2096, "'ve": 961, "bit": 890, "buildcraft": 20, "any": 4000, "redundant/unnessecary": 2, "things": 741, "deprecated": 1092, "languageregistry": 2, "mod": 167, "stirling": 40, "engine": 408, "requested": 447, "st": 36, "'ll": 489, "do": 7716, "'s": 7430, "easier": 581, "eyes": 16, "samplefilewriter_code.ump": 1, "caused": 541, "expected": 1138, "output": 1773, "go": 711, "unreported": 2, "has": 5111, "led": 39, "approximately": 12, "outputs": 130, "included": 636, "suites": 69, "ran": 264, "umple": 59, "each": 2134, "recorded": 162, "appropriate": 458, "have": 7384, "been": 3010, "carefully": 22, "checked": 388, "looking": 287, "help": 600, "experienced": 10, "contributor": 68, "examplefile.ump": 1, "case": 3711, "exactly": 186, "directly": 792, "below": 396, "alloytemplatetest.java": 1, "static": 1381, "variable": 1290, "controlling": 22, "numbering": 21, "transitions": 61, "carried": 21, "producing": 46, "statemachinetest.java": 3, "clear": 764, "state": 2196, "event": 2179, "-fixed": 24, "recursive": 128, "problem": 1208, "interfaces": 365, "-added": 45, "verify": 1236, "correct": 1758, "ensure": 1303, "implements": 440, "interface": 1857, "n't": 8799, "explicitly": 509, "indentation": 362, "umpleinternalparser_codeclass.ump": 1, "attempting": 159, "travis": 1028, "failure": 771, "seperating": 4, "javainterfacetemplatetest.java": 1, "hierarchy": 159, "properly": 1065, "traverses": 7, "entire": 280, "additional": 1142, "making": 755, "pr": 3626, "because": 3034, "rebased": 49, "dumb": 21, "way": 1782, "messed": 38, "history": 426, "getinputfile": 1, "getinputmap": 1, "resolve": 617, "manually": 590, "relative": 363, "getter": 216, "conkeyref": 4, "processing": 824, "temporary": 468, "scheme": 204, "matching": 572, "directory": 1479, "structure": 550, "e.g": 1144, "flattens": 5, "unit": 2769, "were": 2228, "_": 182, "revert": 1039, "rem3-0": 14, "deadlock": 79, "connection": 1692, "closing": 310, "while": 1468, "writing": 415, "reverts": 575, "remoteconnectionhandler.closecompleted": 1, "called": 1675, "remoteconnection": 1, "socket": 278, "channel": 781, "closed": 512, "prevent": 1032, "rejected": 68, "execution": 961, "exceptions": 899, "endpoint": 696, "protocol": 414, "&": 2128, "executor": 402, "gone": 112, "bz-0": 11, "introduce": 335, "outboundmessage.cancel": 1, "fall": 161, "thru": 16, "flush": 201, "our": 1298, "consent": 98, "removal": 282, "reverting": 129, "these": 2418, "involved": 75, "writers": 48, "validators": 33, "must": 1537, "specified": 1654, "able": 796, "publication": 114, "permalink": 14, "notifications": 353, "autoredirect.jsp": 2, "app": 1555, "tracker.silverpeas.org": 7, "further": 469, "details": 856, "silverpeas-core": 15, "submitted": 144, "decimal": 124, "places": 259, "attendsmark": 1, "deb/rpm": 24, "crossbuild": 19, "github.com": 781, "stratio/crossdata": 39, "testing": 1751, "es": 224, "java.sql.timestamp": 7, "estest": 4, "conflicts": 1027, "testsat/src/test/java/com/stratio/tests/atelasticsearchxdtest.java": 1, "log": 2487, "timestamp": 488, "convertion": 9, "fails": 846, "shits": 2, "part": 1642, "src/test/resources/features/elasticsearch/elasticsearchelectand.feature": 13, "src/test/resources/features/elasticsearch/elasticsearchselectinfilter.feature": 13, "src/test/resources/features/elasticsearch/elasticsearchselectequalsfilter.feature": 13, "src/test/resources/features/elasticsearch/elasticsearchselectgreaterfilter.feature": 13, "src/test/resources/features/elasticsearch/elasticsearchselectgreaterequalsfilter.feature": 13, "src/test/resources/features/elasticsearch/elasticsearchselectlessfilter.feature": 13, "src/test/resources/features/elasticsearch/elasticsearchselectlessequalsfilter.feature": 13, "src/test/resources/features/udaf/group_concat.feature": 22, "src/test/resources/features/elasticsearch/temporaryviews.feature": 13, "src/test/resources/features/elasticsearch/views.feature": 13, "native": 526, "date/timestamp": 1, "about": 1774, "imagedescription": 3, "tag": 1145, "tiffcomment": 4, "present": 846, "place": 632, "sphinx": 23, "requirement": 146, "tiff": 19, "algorithm": 280, "characters": 521, "sha256withecdsa": 5, "information": 1592, "logging": 1570, "match": 1276, "usable": 87, "groups": 542, "preferred": 134, "postponed": 9, "cipher": 64, "spec": 401, "achim": 84, "kraus": 84, "bosch": 86, "software": 797, "innovations": 85, "gmbh": 111, "increase": 364, "permgen": 11, "surefire": 54, "plugin": 2648, "permgensize": 1, "128m": 1, "downstream": 97, "vmopts": 1, "property": 2274, "larger": 163, "their": 1284, "enable": 1009, "us": 660, "perm": 17, "gen": 61, "kafka-connect-jdbc": 1, "failing": 684, "jenkins": 395, "right": 1061, "hibernate": 632, "workspace": 521, "frontier": 4, "slicing": 4, "caching": 292, "auth": 393, "principal": 124, "latest": 1097, "jdbc": 273, "align": 136, "javassist": 13, "dependency": 1933, "really": 586, "turn": 341, "schema": 791, "too": 1249, "initialize": 512, "emf": 7, "once": 1214, "smallint": 1, "satisfy": 52, "nazis": 1, "natively": 10, "supports": 396, "uuids": 37, "forced": 84, "tightening": 5, "good": 525, "exposed": 137, "serialization": 456, "had": 938, "disable": 832, "bytecode": 42, "unknown": 299, "reason": 518, "loses": 23, "lunch": 2, "oddly": 3, "did": 1364, "impact": 96, "performance": 760, "system": 1516, "benchmarks": 36, "hasnot": 2, "pretending": 5, "hascontainers": 1, "step": 639, "count": 868, "abuse": 10, "bipredicate": 1, "represent": 134, "nulls": 67, "otherwise": 1190, "again": 974, "testgremlincompilewherelocaldate": 1, "failures": 406, "obvious": 73, "comparing": 100, "dates": 216, "zones": 50, "duration": 250, "seem": 177, "require": 518, "columns": 509, "pom": 850, "maven": 1480, "javadoc": 1328, "source.jar": 2, "mvn": 357, "install": 558, "comments": 1822, "nosearch": 2, "fit": 162, "requirements": 128, "sonatype": 221, "hosting": 22, "maybe": 251, "you": 4061, "scm": 60, "settings": 1306, "am": 262, "sure": 1912, "hg": 10, "usually": 151, "hope": 284, "jedis": 58, "central": 161, "task-related": 2, "apis": 282, "review": 1957, "diff": 195, "retrieve": 564, "persisted": 170, "activities": 192, "saved": 329, "every": 862, "them": 2293, "server": 3456, "call": 2312, "paged": 20, "deleted": 797, "finished": 353, "joined": 33, "study": 273, "whose": 133, "wish": 50, "provided": 1086, "returned": 1049, "offsetby": 4, "flexible": 65, "essentially": 60, "allows": 1445, "through": 1266, "delete": 1639, "normally": 131, "development": 488, "deletes": 177, "completed": 333, "tasks": 725, "contacts": 53, "recreated": 34, "unstarted": 4, "constraints": 253, "scheduling": 75, "expired": 154, "whether": 1147, "most": 871, "useful": 793, "thing": 381, "changing": 807, "schedules": 35, "scheduled": 191, "developers": 110, "open311": 2, "improvements": 640, "open": 1844, "stop": 980, "category": 306, "reset": 743, "services": 630, "spinner": 152, "button": 1546, "press": 93, "validate": 543, "fields": 1679, "submitting": 86, "typos": 276, "implement": 1092, "callback": 534, "method": 8217, "reporting": 290, "fragments": 143, "istransitopen311servicebytype": 1, "service": 2210, "utils": 161, "fragment": 453, "closes": 134, "via": 1469, "manage": 240, "mechanism": 351, "described": 313, "best-practices": 3, "transit": 41, "indicates": 272, "oba": 3, "trip": 149, "dynamic": 423, "looks": 442, "predefined": 46, "keywords": 97, "tries": 225, "determine": 497, "e.g.": 77, "arrival": 17, "git": 698, "ignore": 1296, "multiplicated": 1, "formater": 4, "format": 1647, "attached": 231, "compile": 460, "needs": 1267, "checkstyle": 668, "configured": 723, "multimodule": 7, "makeover": 5, "site": 404, "generation": 574, "declared": 179, "maven-java-formatter-plugin": 1, "java-formatter": 2, "stands": 11, "upon": 291, "esigate": 1, "esigate-tool-conf": 1, "future": 812, "hold": 221, "pmd": 92, "already": 2133, "root": 804, "level": 1534, "configuration": 3361, "formatting": 1081, "made": 1810, "mananger": 1, "refactored": 678, "onclick": 37, "cleaned": 463, "onpoll": 1, "merged": 637, "contructor": 7, "references": 702, "updatedialog": 1, "playbuttonlistener": 2, "dialog": 973, "voddialogfragment": 1, "start_vod==false": 1, "changed": 3438, "torrent": 23, "downloaded": 119, "shows": 360, "download": 617, "status": 1660, "vlc": 12, "video": 336, "ready": 341, "streamed": 30, "showing": 316, "play": 321, "pressed": 68, "inform": 49, "mess": 66, "add/update": 5, "recent": 292, "pages": 480, "unique": 363, "plurals": 16, "arabic": 24, "strings": 1052, "special": 526, "approach": 229, "locale": 313, "here": 2063, "care": 253, "actual": 686, "except": 423, "last": 1380, "translating": 27, "convenient": 75, "just": 3142, "refactor": 1567, "front": 140, "end": 1343, "repository": 855, "define": 400, "public": 2046, "api": 3617, "itemrepository": 1, "filter": 1673, "condition": 576, "repositories": 201, "angularjs": 16, "component": 992, "refresh": 471, "parameter": 1913, "interpretation": 10, "events": 1129, "reloading": 82, "whole": 398, "*": 6991, "depend": 198, "abstract": 403, "factory": 571, "components": 573, "chrome": 117, "extension": 608, "sharing": 140, "linting": 56, "kurento-extension.js": 2, "includes": 671, "jirajobaction": 3, "names": 1756, "url": 2102, "encoded": 177, "pipeline": 252, "encode": 108, "/": 2657, "non-url": 4, "safe": 372, "feature/example-0": 2, "%": 1655, "2fexample-0": 2, "scenario": 170, "jira": 260, "fail": 1208, "wildcards": 46, "imports": 963, "offlinebufferingtest.testmanymessagebufferanddeliver": 5, "accidential": 7, "entry": 951, "inetaddress.getbyname": 3, "speed": 248, "host": 729, "resolution": 325, "ip": 390, "adresses": 5, "opening": 219, "tcpconnection": 1, "o.c.opibuilder": 13, "honour": 11, "ctrl+shift": 2, "together": 231, "opis": 2, "integration": 1455, "opishell": 12, "openopishellaction": 2, "opendisplayaction": 1, "replace": 1329, "target": 950, "opi": 29, "shell": 237, "opens": 152, "identical": 123, "opendisplaytarget": 1, "enums": 136, "consistent": 491, "lastseen": 8, "keep": 920, "track": 440, "agents": 51, "agent": 309, "heartbeat": 116, "snippet": 39, "joins": 53, "cluster": 568, "renaming": 308, "dist.xml": 2, "dist-multiplatform.xml": 1, "release.json": 4, "release-multiplatform.json": 1, "unnecesary": 15, "prefixes": 83, "ead2": 1, "give": 485, "artifacts": 300, "assembly": 122, "updating": 1023, "release": 1973, "actifacts": 1, "including": 619, "launchers": 6, "multiplatform": 3, "addition": 395, "adheres": 4, "wiki": 219, "setting": 1302, "date": 1577, "invalidating": 14, "cookies": 106, "access": 1468, "token": 1034, "always": 1538, "ref": 211, "appid": 13, "login": 599, "clustering": 46, "disabled": 729, "leader": 64, "resource": 1679, "pool": 570, "worker": 286, "heart": 16, "beat": 7, "processed": 277, "updateheartbeat": 1, "resourcemanagerapiserviceimpl": 1, "known": 348, "database": 1492, "restore": 356, "cookie": 228, "invalidation": 47, "yes": 534, "findsecuritybugs": 123, "verified": 289, "report": 1153, "confirmed": 187, "passwords": 194, "tokens": 404, "usernames": 139, "secrets": 165, "extracting": 110, "base": 1008, "requiring": 80, "small": 1137, "extracts": 101, "abstractestest": 2, "nosql-unit": 2, "embedded": 283, "helps": 129, "transition": 125, "period": 230, "http": 1237, "client": 2806, "tweak": 201, "meantime": 17, "headers": 663, "graylog": 73, "free": 523, "redistribute": 176, "and/or": 439, "modify": 816, "under": 1366, "terms": 459, "gnu": 527, "general": 878, "published": 287, "foundation": 504, "either": 887, "distributed": 545, "warranty": 245, "even": 1209, "implied": 234, "merchantability": 150, "fitness": 150, "purpose": 408, "received": 457, "copy": 1375, "along": 419, "unset": 60, "keyproperty": 2, "years": 64, "copyright": 2146, "original": 1040, "author": 298, "authors": 206, "solutions": 32, "relying": 67, "backlog-0": 151, "enchase": 1, "caclulation": 1, "frame": 254, "scrollwidth/height": 1, "double": 634, "consistency": 244, "css": 437, "controlls": 3, "reports": 346, "sse": 30, "preceding": 21, "handlers": 248, "ssl": 290, "chunked": 38, "encdding": 1, "if-statement": 3, "previously": 690, "connect": 440, "https": 302, "sseinboundhandler": 1, "ssechannelhandler": 1, "serversenteventdecoder": 3, "decoder": 51, "handler": 812, "chain": 280, "operate": 37, "enroll": 7, "style": 1144, "enlarge": 4, "font-size": 9, "board/issue": 2, "repositioned": 5, "label": 620, "duplicated": 232, "yobi.label": 2, "init": 362, "active": 604, "switch": 762, "color": 628, "between": 1329, "panel": 368, "left": 671, "windows": 713, "installation": 235, "upgrading": 155, "geoserver": 73, "results": 1114, "corrupt": 17, "data_dir": 10, "geos-0": 65, "overwrite/place": 1, "de": 502, "uninstalling": 5, "rewritten": 44, "installer": 84, "detects": 72, "language": 620, "warnings": 823, "setup": 913, "compilation": 346, "folder": 1048, "developer": 193, "invalid": 702, "links": 875, "agreements": 18, "entries": 701, "availabel": 1, "regarding": 180, "following": 1082, "addons": 25, "doc": 613, "migrated": 97, "improvement": 248, "gives": 197, "freedom": 2, "developing": 24, "expose": 323, "menu": 1112, "mandatory": 113, "anymore": 459, "addons/readme.md": 1, "moved": 1405, "junit": 562, "scope": 497, "want": 1364, "tree": 425, "upgraded": 218, "libraries": 404, "bouncy": 12, "castle": 15, "logger": 470, "slf4j": 176, "jdk": 426, "replaced": 855, "commons": 287, "io": 155, "standard": 585, "library": 1176, "creates": 1072, "shaded": 35, "everything": 527, "readme": 1052, "reflect": 332, "consumers": 60, "frustrated": 2, "having": 595, "convergent": 1, "please": 1137, "accept": 440, "accumulo-0": 104, "tracing": 67, "trace": 395, "table": 1855, "utilities": 113, "wording": 132, "zipkin": 10, "params": 375, "how": 1496, "configure": 561, "spanreceiver": 1, "accumulo": 62, "documents": 252, "watchedcdxsource": 1, "mac": 177, "increased": 106, "wait-time": 1, "mac-specifc": 1, "waiting": 301, "number-of-test": 1, "watchedcdxsourcetest": 1, "increases": 62, "timeout": 767, "seconds": 514, "macs": 2, "runs": 440, "running": 1706, "accessor": 79, "per-target": 3, "coverage": 451, "fixup": 128, "accumulated": 11, "immutable": 187, "underlying": 305, "continue": 347, "mutated": 17, "hsmetriccollector": 1, "related": 1195, "programmatically": 36, "lot": 422, "nice": 219, "per-base": 2, "one-line": 8, "available": 1810, "messages": 1693, "destined": 2, "sent": 713, "dtls": 25, "established": 46, "y": 258, "c": 1351, "others": 282, "virtual": 160, "options": 1110, "serial/parallel": 2, "mode": 1342, "execute": 650, "calling": 623, "thread": 1547, "scans": 68, "spring": 667, "executors": 40, "propagate": 100, "requestcontext": 9, "securitycontext": 3, "threads": 483, "workers": 84, "discard": 59, "policy": 339, "explicit": 362, "queue": 549, "size": 1691, "naver": 8, "corp.": 12, "corp": 8, "given": 3479, "nothing": 945, "creating": 931, "device": 513, "driver": 479, "adb-command": 1, "scenarios": 121, "parentheses": 49, "echo": 47, "home": 802, "skip": 712, "unexpcted": 2, "toupercase": 1, "tolowercase": 16, "specs": 90, "reduce": 532, "redundant": 454, "logs": 646, "digit": 35, "side": 641, "setdevicelocale": 1, "add_setting_locale_via_app": 1, "focus": 267, "merging": 349, "package.json": 37, "appium-adb": 3, "io.appium.settings": 1, "large": 426, "slide-ins": 4, "scrollable": 14, "max-size": 6, "mobile": 284, "devices": 369, "bar": 565, "slide-in": 14, "white": 172, "gc-0": 5, "priority": 229, "blue": 61, "slightly": 222, "off-blue": 2, "clash": 24, "entirely": 83, "purplish": 2, "row": 575, "backgrounds": 13, "colour": 38, "overriding": 160, "span": 86, "itself": 504, "seems": 620, "easiest": 20, "accomplish": 10, "else": 593, "'d": 235, "tables": 443, "solution": 389, "nicer": 78, "develop": 763, "tgac/miso-lims": 3, "gc-6624_blue_alerts": 1, "missed": 280, "multiplayer": 22, "maps": 282, "+": 2667, "externally": 58, "connecting": 98, "font": 245, "colors": 195, "scrolling": 103, "gui": 343, "chat": 298, "box": 430, "notifying": 26, "playing": 73, "save": 841, "ingame": 6, "pause": 122, "probably": 470, "stuff": 652, "forgetting": 8, "old": 1666, "buttons": 462, "crashing": 61, "decompiled": 21, "jad": 10, "v1.5.8g": 9, "pavel": 9, "kouznetsov": 9, "decompiler": 12, "packimports": 9, "braces": 55, "deadcode": 9, "referenced": 162, "package": 1747, "net.minecraft.src": 5, "enumos2": 4, "ispn-0": 183, "doclets": 2, "dedicated": 147, "jar": 856, "building": 430, "distribution": 287, "jdk10+": 1, "dependencies": 1510, "jaxb": 119, "where": 2597, "karaf": 125, "jpa": 155, "elasticsearch": 269, "boot": 208, "dead": 196, "xmlconfighelper": 1, "javax.annotation-api": 1, "jdk11": 39, "jdk-specific": 1, "implementations": 474, "infinispan-commons": 4, "multi-release": 3, "stackwalker": 1, "sun.reflect.reflection": 3, "10+": 5, "runtime.getruntime": 6, ".availableprocessors": 3, "cgroups": 1, "quotas": 3, "packaging": 114, "bundle": 799, "manifest": 252, "goal": 205, "maven-bundle-plugin": 9, "upgrade": 1297, "jboss": 615, "marshalling": 18, "mockito": 165, "bytebuddy": 18, "objenesis": 14, "byteman": 19, "uberjar": 9, "builds": 512, "cast": 359, "appclassloader": 1, "urlclassloader": 10, "provides": 631, "processors": 73, "obtain": 255, "cpu": 165, "mask": 61, "shares": 31, "cfs": 7, "quota/period": 1, "ratio": 82, "linux": 232, "strategy": 333, "b": 488, "/b": 199, "keystore": 98, "openssl": 19, "downside": 16, "lots": 140, "boilerplate": 42, "wait": 764, "http/2": 36, "occur": 199, "notes": 383, "business": 191, "usual": 72, "10/11": 3, "mr": 14, "tested": 1063, "openjdk": 72, "8u162": 1, "10+46": 1, "11+7": 1, "darker": 11, "german": 179, "undo": 131, "holo_blue_dark": 1, "fitting": 19, "stay": 104, "0x404040": 1, "break": 484, "theming": 8, "commits": 574, "sum": 128, "pushstate": 2, "unnecessary": 1073, "specify": 577, "radix": 3, "parseint": 4, "tweak-logline-link": 2, "classnames": 11, "shouldcomponentupdate": 4, "random": 467, "newlines": 76, "appearing": 35, "dont": 110, "try": 1405, "clever": 6, "pulling": 62, "handlebars": 7, "loglines": 1, "append/prepend": 1, "incomplete": 115, "discarding": 15, "dupe": 13, "long": 1236, "bugs": 560, "paging": 82, "scroll": 162, "bottom": 232, "tailing": 5, "initial": 1031, "fetch": 488, "didnt": 10, "fill": 244, "tab": 484, "esc": 25, "join": 312, "game": 255, "statements": 338, "combined": 142, "piece": 61, "escape": 185, "screens/tabs": 1, "startup": 355, "thanks": 381, "st-0": 1, "source/target/release": 1, "java.version": 3, "maxpermsize": 5, "wfcore-0": 114, "extend": 331, "cli": 230, "security": 616, "command": 1740, "sasl": 54, "authentication": 607, "community": 289, "commands": 508, "ctx": 25, "reload": 219, "filesystem": 106, "realm": 235, "ok": 439, "reuse": 261, "oob": 6, "applicationrealm": 6, "effect": 296, "constant": 486, "mapper": 178, "domain": 554, "realms": 25, "mechanisms": 45, "digest": 76, "capture": 153, "secured": 22, "forbidden": 37, "xxx": 74, "ok.": 27, "re-enable": 58, "re-using": 7, "key-store-realm": 2, "roles": 215, "address": 1112, "planing": 1, "pilot": 1, "eap7-0": 1, "elytron": 58, "undertow": 17, "kafka": 220, "producer": 82, "system.properties": 1, "consumer": 200, "idletimeout": 1, "hour": 106, "position": 646, "*/": 203, "mysql": 225, "prepared": 79, "xa": 20, "transaction": 555, "terminal": 173, "xid": 24, "mariadb": 16, "start_encryption_log_event": 1, "gtid": 3, "transactionbegin": 1, "transactionend": 1, "rollback": 142, "startposition.setgtid": 1, "'f1ceb61a-a5d5-11e7-bdee-107c3dbcf8a7": 1, "1-0": 30, "topic": 132, "thread.sleep": 38, "}": 2470, "catch": 796, "interruptedexception": 38, "e": 372, "printsummary": 2, "batchid": 2, "printentry": 2, "message.getentries": 2, "no-op": 180, "process": 1399, "1.": 197, "canal": 10, "destination": 204, "2.": 192, "canal.properties": 1, "canal.withoutnetty": 1, "netty": 180, "nio": 27, "prducer": 1, "upstream/develop": 75, "features/amqp-extension": 1, "hook": 239, "proxyserviceextensions": 1, "chance": 118, "proxy": 665, "executed": 415, "initacceptsession": 1, "until": 918, "own": 838, "initialization": 392, "sessionopened": 3, "ensures": 277, "importantly": 23, "codec": 74, "decoded": 48, "port": 964, "getallstacks": 2, "inventory": 161, "getinventoryname": 3, "convert": 860, "userdata": 19, "pass": 1266, "objects": 1078, "registry.convert": 1, "lua": 12, "ported": 76, "vanilla": 161, "controller": 492, "upgrades": 104, "transposers": 1, "etc": 689, "functions": 691, "my": 1104, "function": 1735, "benefit": 51, "fooling": 1, "array": 1240, "slot": 190, "iterating": 56, "nil": 30, "itemstacks": 22, "getstackinslot": 1, "know": 809, "interacting": 36, "corellated": 1, "may": 1979, "hard": 304, "spot": 77, "getapplications": 2, "notfoundexception": 19, "emails": 79, "detailed.archival": 2, "directories": 227, "happens": 324, "edge": 279, "submission": 85, "failed": 871, "user/group": 3, "jobrequest.emails": 2, "completion": 171, "detailed": 158, "genie": 51, "debugging": 359, "print": 445, "killed": 89, "jobs": 467, "exist": 791, "above": 527, "bash": 100, "cleaning": 321, "well": 1383, "kills": 16, "child": 431, "processes": 154, "remaining": 284, "metric": 446, "tracks": 61, "deletion": 204, "archiving": 15, "valid": 953, "checking": 802, "shutting": 47, "down": 809, "stim": 2, "gray": 40, "indicators": 42, "background": 454, "numeric": 136, "indicator": 199, "styling": 214, "few": 1013, "histogram": 89, "loop": 556, "going": 458, "disconnect": 86, "xp-0": 87, "tslint": 53, "rules": 644, "strict": 134, "equals": 357, "undefined": 140, "==": 447, "===": 9, "dumping": 15, "timeouts": 135, "jettyclientdiagnostics": 3, "dump": 164, "certain": 382, "rate": 269, "limit": 640, "debug": 886, "jettyhttpclient": 4, "dumps": 19, "timeoutexception": 8, "total": 395, "ms": 117, "begin-to-end": 1, "response": 1610, "begin": 176, "10s": 26, "responsebegintimestamp": 1, "very": 633, "specific": 1323, "ideas": 20, "generic": 697, "me": 747, "heavy-weaponry": 2, "websockets": 20, "firefox": 110, "connections": 402, "allowing": 319, "idea": 486, "valencia": 11, "issue-0": 110, "simplified": 246, "trigger": 541, "lantern": 48, "workaround": 336, "localized": 84, "websocket": 87, "disconnected": 66, "kept": 161, "minimal": 160, "store": 1287, "complex": 208, "stores": 245, "simpole": 1, "description": 924, "controlled": 64, "annotation": 798, "publisher": 142, "metabroadcast_similar_content": 1, "metabroadcast": 7, "computations": 22, "according": 477, "precedence": 83, "across": 332, "publishers": 37, "notify": 196, "ignored": 508, "resulting": 226, "non-working": 4, "223_issue": 3, "dir": 270, "ca": 789, "reproduce": 114, "pc": 15, "reproduced": 32, "ci": 653, "filtering": 341, "experimental": 101, "rollbacked": 8, "appear": 244, "converter": 198, "extract": 569, "inner": 277, "testable": 25, "hackish": 3, "requires": 530, "rule": 678, "descriptor": 145, "simpler": 140, "staticinstallsupport": 2, "bundlecontexts": 2, "featureserviceimpl": 2, "servicebundle": 2, "featurefinder": 1, "activator": 26, "repositorycache": 1, "urls": 417, "groupid/artifactid/version": 1, "eventadmin": 1, "outer": 78, "cache": 1884, "mean": 144, "field": 2525, "openmrs": 109, "obs": 34, "working": 1244, "peer": 89, "grouping": 76, "members": 244, "retrieving": 122, "confusing": 99, "behaviour": 553, "retrieved": 154, "behave": 65, "deferently": 1, "form": 1004, "unable": 150, "fm-0": 5, "necessary": 926, "contained": 187, "apache": 532, "cherry": 326, "picked": 405, "javafx-native": 1, "svgpath": 2, "logo": 188, "de.codecentric.centerdevice": 1, "javafxsvg": 1, "1.3.0": 3, "usages": 125, "changelog.md": 239, "features": 779, "jabref": 183, "screenshots": 235, "bigger": 238, "ui": 1561, "downgraded": 14, "derby": 56, "10.10.1.1": 1, "spark": 190, "branch-version": 18, "cd364_derby_version": 1, "opt": 31, "vs": 148, "otp": 25, "throwable": 156, "scripting": 39, "sshfeed": 6, "execascommand": 2, "execasscript": 1, "sshtool": 11, "run": 2791, "compatibility": 622, "execscript": 2, "incompatible": 58, "override": 881, "ssh": 165, "w/": 91, "knife": 12, "sshmachinelocation": 20, "hostname": 194, "overridden": 186, "machinelocation": 11, "unchanged": 75, "private": 942, "reachable": 33, "brooklyn": 148, "management": 448, "console": 513, "firewall/port-forwarding": 1, "ssh-accessible": 1, "alternative": 196, "retrieves": 144, "alters": 13, "converge": 9, "task": 1579, "host-and-port": 1, "bootstrap": 312, "operation": 875, "delegates": 78, "reinstate": 20, "knifewhichport": 1, "taking": 186, "hostandport": 11, "instance": 2435, "aids": 3, "hosts": 141, "knifeconvergetaskfactory": 1, "cloud": 273, "configurations": 290, "network": 809, "arrowtaggedactivity": 5, "listview": 81, "recyclerview": 30, "design": 275, "guidelines": 75, "populated": 126, "hit": 190, "came": 62, "reduced": 134, "layer": 721, "overdraw": 4, "moving": 467, "cardview": 18, "normal": 398, "improved": 648, "overall": 82, "look": 788, "avatar": 67, "imageview": 30, "xml": 1135, "list_item_avatar": 1, "sparsearray": 2, "recommended": 122, "advocates": 1, "memory": 773, "avoid": 1892, "divider": 29, "no-wrap": 1, "gold": 28, "gilding": 3, "badge": 102, "force": 509, "rebuild": 86, "noticed": 150, "today": 117, "phone": 153, "xn": 2, "inserted": 110, "artificial": 7, "white-space": 5, "happen": 472, "emulator": 120, "replaces": 249, "regular": 301, "non-breakable": 1, "directdataloader": 1, "locations": 232, "tracker": 103, "consequence": 23, "proxyreferences": 1, "chromosomes": 7, "transcripts": 14, "full": 806, "reference": 1232, "transcript": 30, "proxyreference": 1, "holder": 129, "inherit": 68, "intermineobject": 3, "ensembl-snp": 1, "maven-release-plugin": 300, "prepare": 538, "singularity-version": 33, "iteration": 365, "stale": 115, "jobid": 10, "workflow": 330, "instances": 808, "ones": 443, "least": 559, "meaning": 124, "workflows": 39, "ids": 610, "determines": 127, "jinjava-version": 36, "accumulation": 13, "dimension": 153, "better/proper": 1, "fo": 18, "accum": 1, "reshape": 17, "-0": 372, "nativeopexecutioner": 1, "allocate": 56, "z": 176, "json": 1532, "pairwise": 39, "equal": 302, "sizes": 153, "tad": 15, "vs.": 57, "entirety": 4, ".equals": 50, "never": 850, "worked": 147, "consider": 250, "nullpointerexceptions": 19, "intended": 263, "migrate": 274, "majority": 23, "junit5": 32, "forgot": 188, "addingn": 1, "supplier": 76, "somre": 1, "mock": 407, "externalfiletypes": 1, "importer": 90, "visiblilty": 1, "formattertest": 1, "architecture": 52, "prefs": 70, "mocked": 76, "away": 209, "getexternalstyles": 1, "thingy": 9, "teh": 19, "contextmanager": 1, "requestproxyservicecontext": 1, "postgres": 161, "separate": 978, "posgresql": 1, "test-schema": 1, "sql": 493, "outside": 311, "chef": 20, "recipe": 102, "postgresql": 212, "travis-ci": 92, "environment": 749, "bridgelistener": 1, "referencelistener": 2, "prep": 27, "vars": 80, "length": 688, "vendor": 68, "securityschemedefinition": 3, "securitydefinition": 3, "vendorextensions": 1, "securitydefinitions": 3, "deserialized": 55, "fork": 135, "synch": 16, "upstream/master": 788, "sb-0": 95, "crud": 41, "orientdb": 52, "patterns": 124, "adopt": 18, "strongbox": 6, "based": 1967, "internet": 78, "initialized": 285, "register": 488, "entities": 414, "whereby": 24, "detachall": 4, "existence": 99, "actually": 998, "marker": 193, "defining": 99, "storage": 625, "select": 681, "strongboxuser": 2, "username": 335, "admin": 583, "separately": 114, "i.e.remotely": 2, "users": 1251, "rest": 1050, "studio/console": 2, "meta": 267, "generalised": 2, "spring-data-orientdb": 2, "detach": 18, "incl": 24, "system-level": 1, "arqajo-0": 5, "header": 1651, "typedselenium": 1, "utility": 568, "basic": 688, "credentials": 355, "headerutils": 1, "tells": 70, "selenium": 96, "specificed": 1, "outgoing": 48, "built": 307, "encodes": 32, "base64": 73, "encoding": 431, "authorization": 202, "professional": 489, "source": 2713, "encapsulates": 34, "instantiation": 121, "corresponds": 36, "password": 715, "ajaxselenium": 1, "encoder": 60, "fro": 10, "credential": 119, "exlude": 1, "cassandra": 320, "info": 1201, "importing": 120, "bug/improveimporttables": 1, "key/value": 58, "pair": 163, "broadcast": 193, "receiver": 101, "permissions": 502, "mocks": 86, "setters": 101, "successful": 261, "async": 299, "connected": 263, "deal": 201, "inject_events": 3, "functional": 305, "enter": 149, "activity": 969, "post": 596, "validating": 97, "true": 1570, "webservice": 58, "webapi": 10, "authenticationresult": 9, "acquiretokenbyrefreshtoken": 1, "quickly": 101, "sending": 498, "finish": 270, "ask": 138, "monitor": 212, "depends": 201, "federated": 17, "adfs30": 1, "adfs20": 1, "adfs": 10, "sts": 7, "tabs": 370, "spaces": 492, "shorter": 74, "hi": 320, "regards": 138, "archived": 61, "currentfilenames": 1, "wants": 125, "rolling": 56, "policies": 48, "assure": 14, "filename": 259, "protobuf": 55, "lite": 20, "nano": 22, "anonymous": 159, "named": 435, "annotate": 39, "visibility": 260, "synthetic": 31, "accessors": 49, "precisely": 15, "t": 508, "optimization": 185, "in-memory": 99, "transport": 209, "protobufs": 2, "assume": 286, "parser": 574, "proto": 46, "guaranteed": 86, "methoddescriptor": 1, "permit": 36, "stream": 1024, "read": 1513, "strange": 75, "transparent": 62, "though": 434, "likely": 203, "buf": 14, "pre-create": 4, "codedinputstream": 1, "restriction": 79, "simonma": 1, "investigate": 54, "0-copy": 1, "copied": 243, "guava": 288, "com.google.common.io.bytestreams": 2, "unstable": 76, "beta": 138, "readme.md": 536, "broken": 633, "jserialcomm": 1, "ugs-settings": 1, "loaded": 584, "disallow": 47, "container": 795, "modification": 262, "inside": 671, "configureeach": 2, "mutation": 72, "guard": 95, "filtered": 154, "conserve": 9, "assert": 457, "composite": 111, "self-mutation": 1, "defaultartifactpublicationset": 3, "indirection": 22, "disabling": 198, "baseplugin": 1, "compositemutationguard": 1, "unecessary": 30, "allowed": 515, "delegate": 184, "differenciate": 3, "mutationguard": 2, "dslobject": 1, "taskcontainer": 7, "project.container": 1, "fixture": 83, "recognize": 87, "google": 530, "notice": 247, "todos": 59, "relaxed": 13, "severity": 63, "___method_name___": 1, "string.valueof": 16, "ioutilities.inputstreamtobytearrayoutputstream": 1, "getstream": 2, "httprequest": 29, "turbolabel": 5, "servicemanager.getinstance": 2, ".getmodel": 2, ".getlabelbyghname": 2, "getlabelname": 2, "levels": 143, "leaving": 100, "450~": 1, "defer": 32, "periodically": 60, "important": 262, "config/checkstyle/checkstyle.xml": 1, "build.gradle": 167, "noise": 88, "tweaks": 255, "adhere": 17, "resourceresolver.map": 2, "..": 166, "transformer": 109, "webconsole": 2, "namehints": 1, "negative": 240, "feature/resourceresolver-map-transformer": 1, "davidjgonzalez/acs-aem-commons": 4, "feature/rr-map-rewriter": 1, "#": 2563, "l": 786, "acs": 187, "aem": 210, "rewriter": 12, "attribute": 1082, "candidate": 106, "rewrite": 145, "clone": 167, "attributes": 827, "absolute": 182, "starting": 458, "w": 95, "relative-scheme": 1, "//": 571, "slingrequest.getresourceresolver": 1, ".map": 5, "slingrequest": 1, "configurable": 427, "mapping": 690, ".html": 9, ".htm": 1, "ootb": 9, "linkchecker": 2, "limitations": 133, "asynccontext": 2, "atmosphere": 3, "refactorings": 67, "dispatching": 30, "immediately": 289, "followed": 90, "queued": 99, "collect": 164, "easing": 4, "verification": 201, "atm": 30, "jetty": 345, "brings": 87, "significant": 87, "rid": 363, "complexity": 91, "hv-0": 300, "implementing": 243, "bootstrapconfiguration": 4, "getvalidatedexecutabletypes": 2, "simplifying": 40, "messageinterpolatorcontexttest": 1, "unwrap": 35, "tck": 102, "changelog": 515, "releases": 219, "my/fix_warnings_in_proxy_classes": 1, "errorprone": 22, "noinspection": 185, "unchecked": 134, "raw": 302, "bw4tclientconfigintegration": 1, "shown": 395, "amount": 357, "e-partners": 4, "bots": 17, "finishes": 49, "conflict": 324, "e-parters": 1, "pops": 13, "pop": 53, "e-partner": 2, "dropped": 165, "bot": 81, "bw4tclientconfig": 2, "triggered": 245, "generates": 272, "bw4tclientintegration": 1, "swingutilities.invokelater": 2, "runnable": 90, "grep": 21, "logtail": 1, "duplicates": 160, "docs": 1117, "arg": 146, "tail": 48, "inefficient": 26, "pipe": 57, "dups": 4, "s3": 241, "finder": 35, "one-liner": 5, "bunch": 199, "plugins": 617, "version-snapshot": 184, "jbide-0": 307, "essential": 21, "quickstarts": 12, "red": 253, "hat": 141, "inc.": 377, "bumped": 128, "newprojectexamplesstacksrequirementspage": 1, "missingrepositorywarningcomponent": 1, "mavenexamplesrequirementspage": 1, "addding": 3, "essentialenterprisedependencies": 1, "org.jboss.bom": 1, "jboss-javaee-version-with-hibernate": 1, "1.0.4.final-redhat-0": 1, "/essentialenterprisedependencies": 1, "quickstart": 65, "regenerated": 32, "sources": 362, "jars": 268, "utf8for": 1, "outputstreamwriter": 8, "efo": 3, "ontology": 27, "term": 214, "expansion": 50, "expanded": 112, "statement": 571, "writer": 154, "writer.close": 3, "cohort": 57, "individual": 305, "vcf": 38, "pheno": 7, "compatible": 419, "aggregate": 130, "exported": 93, "observedvalue": 10, "ontologybuilder.java": 1, "utf8": 44, "topology": 127, "belongs": 99, "patch": 838, "ali": 2, "hammad": 2, "encounter": 101, "dr": 10, "visit": 103, "ifs": 11, "readability": 148, "pharm": 1, "populated.render": 1, "currentusersession": 1, "viewmodelget": 1, "patient": 235, "prescriptions": 10, "medical": 20, "pharmacy": 6, "datamap": 8, "reverse": 186, "engineering": 18, "mode-0": 124, "sns": 5, "arrays": 250, "httpclient": 148, "re-enabled": 21, "node2": 3, "childnode": 1, "node1/child2": 1, "appending": 58, "segments": 51, "supporting": 163, "children": 282, "meant": 131, "quote": 110, "separator": 159, "parameters": 1513, "csv": 243, "column": 1052, "hidden": 226, "inputs": 204, "solve": 157, "claudia-0": 5, "traceinterceptor": 1, "remvoe": 3, "multi": 192, "licnse": 1, "product": 230, "metadata": 1289, "inclusion": 67, "tenantid": 31, "nexus": 367, "generalvalidator": 1, "paasmanageruser": 1, "getcredentials": 6, "openstackuser": 1, "ips": 28, "arraylist": 140, "locally": 298, "uploaded": 103, "kfspts-0": 151, "dbcp": 9, "route": 347, "stoping": 2, "cbcp": 1, "routing": 161, "iterative": 39, "seperate": 53, "improving": 156, "email": 558, "messageformatsafenewline": 1, "n": 301, "non": 388, "prod": 59, "repo": 617, "unix_setup.sh": 1, "verbose": 143, "assist": 28, "extraneous": 69, "$": 1109, "posix": 14, "compliant": 48, "tsk_version": 1, "upstream": 245, "sleuth": 1, "kit": 31, "bindings": 176, "covered": 149, "previous": 1067, "if-then": 1, "domnotifier": 1, "getdom": 2, "pulls": 46, "crawljax-version": 1, "chat-0": 50, "upload": 628, "due": 1131, "permission": 551, "pp": 8, "keybindings": 6, "forgotten": 59, "navigation": 255, "keyboard": 188, "designated": 9, "marco": 10, "vtype.pv": 27, "level.fine": 3, "o.a.beast.alarm.server": 1, "ide": 199, "tycho": 16, "cs-studio-sns/repository": 1, "keeping": 131, "alarmserver.product": 1, "non-sns": 1, "launch": 257, "alarm": 174, "o.c.alarm.beast.server.test": 2, "origin/bug685_tests": 1, "bug685_tests": 1, "major": 161, "ack": 71, "less": 614, "severe": 18, "stays": 40, "acknowledge": 6, "what": 1389, "i.e": 476, "latched": 1, "undefined_ack": 1, "baseline": 59, "org.csstudio.utility.namespace.utility": 1, "contents": 413, "org/csstudio/utility/namespace/utility/controlsystemitem.class": 1, "incremented": 38, "numbers": 381, "diagnosis": 10, "patients": 31, "record": 682, "renal": 6, "logged": 317, "noneditablecomponents.add": 2, "renalunit": 2, "cacherefresh": 1, "triggers": 113, "instanceinforeplicator": 1, "registration": 299, "eagerly": 44, "pre": 324, "sni": 16, "super": 186, "dummies": 1, "contain": 585, "codeclimate.yml": 1, "webapp": 114, "codeclimate": 10, "think": 438, "tried": 230, "excluded": 156, "excluding": 86, ".js": 8, "propose": 41, "nexus-0": 431, "framework": 467, "bits": 160, "nuget": 43, "impl": 216, "gate": 26, "singleton": 265, "alin": 3, "suggestion": 69, "concat": 38, "initially": 106, "provisioned": 20, "tm": 177, "bypass": 71, "purposes": 173, "user-agent": 40, "mfi": 1, "imf": 1, "c++": 116, "constexpr": 5, "rc3otffullirtest": 2, "specifier": 10, "derived": 117, "applicable": 197, "isresetonly": 1, "simplify": 520, "batch": 415, "ws.js": 1, "matter": 105, "many": 625, "ws": 128, "efficiently": 26, "intial": 15, "loads": 200, "redraw": 19, "rulesets": 8, "xml/ws": 1, "web": 708, "identically": 10, "ruleset": 20, "cleared": 127, "reducing": 96, "chances": 12, "unittests": 30, "labels": 322, "frontendsettings": 4, "grandparent": 2, "means": 572, "overrides": 210, "hardcode": 21, "assumption": 73, "hardcoded": 172, "wise": 23, "accessed": 167, "easy": 285, "top": 610, "selinux": 8, "vnc": 7, "machine": 329, "enabling": 118, "flag": 854, "docker": 576, "volume": 100, "yoinking": 1, "mike": 18, "codezz": 1, "experiment": 80, "blocks": 535, "searching": 139, "skeleton": 68, "browse": 93, "experiments": 34, "experimentblocks": 1, "nowgit": 1, "ios": 157, "title": 696, "rap": 27, "p": 2429, "presentation": 77, "scaling": 61, "area": 205, "relied": 27, "inheriting": 14, "svg": 81, "g": 72, "stylesheet": 54, "generating": 237, "poll": 73, "grab": 96, "resulted": 58, "treated": 113, "blank": 241, "filenames": 48, "images": 549, "subdirectories": 21, "recording": 123, "aws": 170, "couple": 400, "playback": 82, "shapes": 55, "int": 760, "boyscout": 2, "ve": 11, "seen": 188, "jfatcatclient": 1, "xtal": 3, "packages": 367, "log4j": 161, "defaults": 431, "structureinterfacelist": 1, "asacalc": 1, "toxyzstring": 1, "prettify": 13, "crystaltransform": 4, "additions": 85, "crystalcell": 2, "getcellindices": 1, "transftoorigincell": 2, "modifying": 108, "modules": 596, "top-level": 80, "intoduced": 1, "version-specific": 4, "vecmath": 7, "older": 259, "several": 518, "practical": 12, "advantages": 10, "jre": 44, "subtle": 14, "main/master": 2, "sbliven/master": 3, "cleanups": 102, "take": 881, "biojava3-alignment/pom.xml": 1, "biojava3-core/pom.xml": 1, "biojava3-modfinder/pom.xml": 1, "biojava3-phylo/pom.xml": 1, "biojava3-protein-disorder/pom.xml": 1, "transformedstruct": 2, "structure.clone": 2, "chains": 37, "au": 6, "hw": 1, "actions": 521, "preference": 320, "arrangement": 3, "translations": 349, "portuguese": 47, "pt": 43, "im": 25, "exposing": 73, "videos": 63, "storing": 172, "httpsession": 10, "mainsessioncontroller": 2, "notification": 625, "silverpeas": 50, "automatic": 179, "looksilverpeasv5helper": 1, "reused": 89, "stored": 658, "myownruns": 1, "fixeddatatable": 3, "facebook": 43, "myownrunsrow": 1, "target=_blank": 1, "changedimension": 3, "teleporting": 3, "players": 127, "abort": 109, "early": 159, "updateentity": 5, "teleportation": 9, "broke": 111, "newer": 239, "forge": 174, "switching": 228, "buffers": 111, "released": 265, "multi-part": 8, "leaking": 34, 